### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.online-data-service-gha-app will be created
  + resource "azuread_application" "online-data-service-gha-app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "faspo-poc-online-data-service-gha"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = true
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application_federated_identity_credential.online-data-service-gha-app-fc will be created
  + resource "azuread_application_federated_identity_credential" "online-data-service-gha-app-fc" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "faspo-poc-online-data-service-gha-fc"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:scoring-system-poc/faspo-online-data-service:ref:refs/heads/main"
    }

  # azuread_service_principal.online-data-service-gha-sp will be created
  + resource "azuread_service_principal" "online-data-service-gha-sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_role_assignment.online-data-service-gha-acr-rbac will be created
  + resource "azurerm_role_assignment" "online-data-service-gha-acr-rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.ContainerRegistry/registries/faspopocacr"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
